<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"093c8b3ddf7706709e2b2d07b1b051be6a124674770b2df6a537305268d99199","plan_job_ref":"Job Plan org changes and list them in a PR #72 at https://github.com/django-commons/controls/actions/runs/10669667654","plan_out_hash":"4aed9744334309ee1405829dacc4ef85ccdd8f296491eefc7c9ff01e13627152","plan_hash":"5d045ef00e9fdd1aecad5d9d96001406a00c1e0f07cdbcc50968453722b8df8b","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 1 to import, 9 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["django-fsm-2"] will be updated in-place
  # (imported from "django-fsm-2")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
!~      allow_merge_commit          = false -> true
!~      allow_rebase_merge          = true -> false
        allow_squash_merge          = true
        allow_update_branch         = true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Django friendly finite state machine support"
        etag                        = "W/\"45b348b36dad1babf0061765b8cf491a53341f2dc36854adec2ffe0c79f230a1\""
        full_name                   = "django-commons/django-fsm-2"
        git_clone_url               = "git://github.com/django-commons/django-fsm-2.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
!~      has_projects                = false -> true
        has_wiki                    = false
+       homepage_url                = "https://github.com/django-commons/django-fsm-2"
        html_url                    = "https://github.com/django-commons/django-fsm-2"
        http_clone_url              = "https://github.com/django-commons/django-fsm-2.git"
        id                          = "django-fsm-2"
        is_template                 = false
!~      merge_commit_message        = "BLANK" -> "PR_BODY"
        merge_commit_title          = "PR_TITLE"
        name                        = "django-fsm-2"
        node_id                     = "************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 555169571
!~      squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
        squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/django-fsm-2.git"
        svn_url                     = "https://github.com/django-commons/django-fsm-2"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.this["playground2"] will be updated in-place
!~  resource "github_repository" "this" {
        id                          = "playground2"
!~      merge_commit_message        = "PR_TITLE" -> "PR_BODY"
!~      merge_commit_title          = "MERGE_MESSAGE" -> "PR_TITLE"
        name                        = "playground2"
#        (35 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_team.repo_admin_team["django-fsm-2"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the django-fsm-2 repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-fsm-2-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["django-fsm-2"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the django-fsm-2 repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-fsm-2-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["django-fsm-2"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the django-fsm-2 repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-fsm-2"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["django-fsm-2"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "natim"
        }
+       members {
+           role     = "member"
+           username = "pfouque"
        }
    }

  # github_team_members.repo_team_members["django-fsm-2"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "natim"
        }
+       members {
+           role     = "member"
+           username = "pfouque"
        }
    }

  # github_team_repository.repo_admin_team_access["django-fsm-2"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "django-fsm-2"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["django-fsm-2"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "django-fsm-2"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["django-fsm-2"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "django-fsm-2"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["django-fsm-2"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 1 to import, 9 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #72](https://github.com/django-commons/controls/actions/runs/10669667654)